[
    {
        "id": "1",
        "title": "Pressure cooker refried beans",
        "difficulty": "Easy",
        "portion": "Serves 4-8 as a side",
        "time": "Hands-on time 15 min. Simmering time 30 min",
        "description": "Using dried instead of tinned beans is cheaper and offers up more flavour, but most of us don’t bother due to the time it takes. A pressure cooker is the solution – better for your time, wallet and for the environment. These refried beans beat anything you can buy and are the perfect introduction to pressure  cooking and dried pulses (a match made in heaven).",
        "ingredients": [
            "500g dried pinto beans",
            "1 tsp dried oregano",
            "1 tsp ground cumin",
            "1 tsp fine sea salt",
            "2 tbsp olive oil or lard",
            "1 large onion, finely chopped",
            "1 jalapeno, finely chopped",
            "3 garlic cloves, chopped",
            "Diced tomatoes, pickled jalapenos and fresh coriander to serve",
            "Pressure cooker"
        ],
        "method": [
            {
                "Step 1": "inse the beans then put them in the pressure cooker with 1.6 litres water. Stir in the oregano, cumin and salt. Add the lid and bring to high pressure then cook for 30 minutes. Allow the steam to release naturally then open and check if they’re done (they should be very tender). Return to high pressure and cook for another 5-10 minutes if needed."
            },
            {
                "Step 2": "Once the beans are cooked, drain them, reserving the cooking water in a jug. Return the pressure cooker to a medium heat (or set to the sauté function if electric), add the oil or lard then cook the onion, jalapeno and garlic with a pinch of salt for about 5 minutes, until softened. Stir in the drained beans then cook for a few minutes, adding a little of their cooking water while mashing with a potato masher until you reach the desired consistency (if you prefer them smoother you can whizz with a hand blender then continue cooking). Season to taste then serve topped with tomatoes, pickled jalapenos and coriander."
            }
        ],
        "image": "1.jpg"
    },
    {
        "id": "2",
        "title": "Black bean chilli soup with corn dumplings",
        "difficulty": "Easy",
        "portion": "Serves 4",
        "time": "Hands-on time 30 min. Simmering time 2 hours",
        "description": "Simmering black beans gently with garlic, chillies and lime rewards you with an easy, flavourful soup that you can leave bubbling away in the kitchen. We’ve taken inspiration from Mexico for this zingy broth, complete with fluffy corn dumplings.",
        "ingredients": [
            "300g dried black, pinto or red haricot beans",
            "1 dried pasilla or ancho chilli, stem and seeds removed, then finely chopped",
            "1 tsp dried oregano",
            "2 tsp fine sea salt",
            "2 garlic cloves",
            "1 green or jalapeno chilli",
            "Sour cream to serve (optional)",
            "Finely grated zest and juice 2 limes",
            "120g masa harina",
            "1 tbsp olive oil",
            "¼ tsp fine sea salt",
            "Bunch coriander"
        ],
        "method": [
            {
                "Step 1": "Rinse the beans then put them in a large saucepan and cover with 1.5 litres water (it should cover the beans with about 5cm water on top). Add the dried chilli, oregano and salt to the pan. Bring to the boil."
            },
            {
                "Step 2": "Meanwhile, put a small dry frying pan over a high heat and add the garlic and green chilli. Cook for 3-5 minutes until charred all over. Leave to cool slightly, then peel the garlic cloves and remove the stem and seeds from the chilli. Finely chop, then add to the pan of beans."
            },
            {
                "Step 3": "Boil the beans for 10 min then reduce to a low simmer, cover and cook for 1½-2 hours until creamy and tender. You’ll need to stir the pot about every 30 minutes to prevent it from sticking."
            },
            {
                "Step 4": "Make the dumplings once the beans have been simmering for 1 hour. Put the masa harina, olive oil and salt in a bowl, then finely chop roughly a third of the coriander and add that too (save the rest to garnish). Slowly add 160ml lukewarm water while mixing the dough with your hands until it comes together. Knead lightly for about 1 minute to form a dough."
            },
            {
                "Step 5": "With wet hands, roll pieces of the dough into small spheres, about the size of a golfball. Lightly press your thumb into the centre of the ball to form a little crater. Pop them on a plate and repeat until all the dough is used up."
            },
            {
                "Step 6": "When the beans are tender add the dumplings to the broth, keeping it at a low simmer (uncovered). Let them sit without stirring at first, then start spooning over some of the broth to help them cook through. After 10 minutes, gently stir the broth to move the dumplings around. Cook for another 5 minutes."
            },
            {
                "Step 7": "Add the lime juice to the soup and season. Serve topped with a dollop of sour cream, the lime zest and the remaining coriander."
            }
        ],
        "image": "2.jpg"
    },
    {
        "id": "3",
        "title": "Fishcake tacos",
        "difficulty": "Easy",
        "portion": "Serves 4 (makes 12 tacos)",
        "time": "Hands-on time 40 min",
        "description": "These spice and smoke fishcake tacos make for a filling midweek dinner. Load taco shells with crispy fishcakes, mango salsa and lime mayo.",
        "ingredients": [
            "300ml semi-skimmed milk",
            "250g undyed smoked haddock, skinned",
            "350g floury potatoes (such as maris piper or king edward), peeled and quartered",
            "1 large mango, peeled, stoned and diced into 1cm cubes",
            "1 small red chilli, finely chopped",
            "Bunch (25g) coriander, finely chopped",
            "Finely grated zest and juice 1 lime",
            "3 tbsp mayonnaise",
            "Bunch spring onions, trimmed and finely chopped",
            "¼ tsp cayenne pepper",
            "1 medium free-range egg, beaten",
            "30g panko breadcrumbs",
            "Vegetable oil for frying",
            "2 little gem lettuces, finely shredded",
            "12 small corn or flour tacos"
        ],
        "method": [
            {
                "Step 1": "Pour the milk into a saucepan and bring to the boil. Turn down the heat and add the smoked haddock, then gently poach for 3-4 minutes until cooked through and flaky. Lift the fish out of the milk with a slotted spoon, then set aside to cool."
            },
            {
                "Step 2": "Put the potatoes in the leftover milk, topping up with water to cover (if needed). Bring to the boil and simmer for 10-12 minutes until very tender. Drain in a colander and set aside to steam dry."
            },
            {
                "Step 3": "Meanwhile, combine the mango with the chilli, half the coriander and half the lime juice. Season with a pinch of salt and mix well. Mix the remaining lime juice with the mayonnaise."
            },
            {
                "Step 4": "Put the spring onions, lime zest and cayenne pepper in a bowl. Add the potatoes with a pinch of salt and mash everything together until well combined. Flake in the fish, add half the remaining coriander, then stir until you have a dry, firm mixture. Shape into small 3-4cm patties, laying them on a tray as you work. You should get around 24 in total."
            },
            {
                "Step 5": "Put the beaten egg in one shallow dish and the breadcrumbs in another. Heat a good glug of vegetable oil in a large frying pan over a medium heat. One by one, dip the fishcakes in the egg, then the breadcrumbs, then put them straight into the frying pan (you’ll need to work in batches, adding more oil as needed). Cook for 2 minutes on each side until golden and crisp, then drain on kitchen paper."
            },
            {
                "Step 6": "To serve, sprinkle shredded lettuce onto each taco. Top with 2 fishcakes, then a spoonful of lime mayonnaise. Finish with the mango salsa and a pinch of the remaining coriander."
            }
        ],
        "image": "3.jpg"
    },
    {
        "id": "4",
        "title": "Black bean and chicken burritos",
        "difficulty": "Easy",
        "portion": "Serves 4",
        "time": "Hands-on time 30 min",
        "description": "Use leftover roast chicken to make these thrifty and delicious chicken burritos. These filling burritos are packed with black beans, rice and guacamole.",
        "ingredients": [
            "1 tbsp vegetable oil",
            "Bunch spring onions, finely chopped",
            "2 garlic cloves, finely chopped",
            "1 tsp cumin seeds",
            "400g tin black beans in water, rinsed and drained",
            "2 tsp smoked paprika",
            "100g cooked rice",
            "1 large avocado",
            "Juice 1 lime",
            "1 red chilli, finely chopped",
            "150g ripe cherry tomatoes, roughly chopped",
            "Bunch fresh coriander, roughly chopped, reserving a few whole leaves to serve",
            "4 large flour tortillas",
            "125g cooked chicken, shredded",
            "100g mild cheddar, grated",
            "Hot sauce such as Tabasco or Cholula to serve (optional)"
        ],
        "method": [
            {
                "Step 1": "Heat the oil in a frying pan, add the spring onions and cook for 3-4 minutes until beginning to soften. Stir in the garlic and cumin, cook for just a minute longer, then add the drained beans and paprika and cook for a further 3 minutes. Add a splash of water to the pan and, with a fork or potato masher, mash the beans until you have a coarse paste. Season to taste, then stir in the rice and remove from the heat."
            },
            {
                "Step 2": "Scoop the avocado into a bowl and mash well with a fork, adding the lime juice as you go. Stir in the chopped chilli, tomatoes and coriander, then season to taste."
            },
            {
                "Step 3": "Warm a flour tortilla in a dry frying pan over a medium heat. Put it on a chopping board, then spread a few tablespoons of the black bean and rice mixture in the centre. Spoon a quarter of the avocado mixture on top, then sprinkle on a quarter each of the chicken and the cheese and a few reserved coriander leaves. Roll up the tortilla tightly, tucking in the ends. Lay seam-side down on the chopping board, then prepare the other tortillas. Serve with hot sauce, if you like."
            }
        ],
        "image": "4.jpg"
    },
    {
        "id": "5",
        "title": "Pork tacos with sweetcorn and feta",
        "difficulty": "Easy",
        "portion": "Serves 2-3",
        "time": "Hands-on time 25 min, plus marinating",
        "description": "Grill marinated chops on the barbecue to make these delicious pork tacos. Load charred tortillas with pork, chillies, herbs and crumbled feta.",
        "ingredients": [
            "2 bone-in free-range pork chops",
            "3 tbsp olive oil",
            "2 large corn-on-the-cobs",
            "6 fresh jalapeño chillies",
            "2 limes, halved",
            "2 tsp coriander seeds",
            "2 tsp cumin seeds",
            "2 garlic cloves, bashed",
            "4 tbsp cider vinegar",
            "1 tsp brown sugar",
            "Small bunch coriander, leaves and stalks finely chopped",
            "6 small wheat or corn tortillas and crumbled feta to serve",
            " Digital thermometer"
        ],
        "method": [
            {
                "Step 1": "Prepare the barbecue for direct heat (for cooking right over the coals; or see alternative cooking instructions in tips). Pat the pork chops dry, then rub with 1 tbsp oil and season well with salt. Grill the chops, corn and chillies (turning them all) until the corn and chillies are lightly charred and the pork is cooked through to your liking (they should read 63°C or over on a probe thermometer). Cook the limes cut-side down for 1-2 minutes until caramelised."
            },
            {
                "Step 2": "Toast the coriander and cumin seeds in a hot dry pan for about 1 minute until fragrant. Lightly crush in a pestle and mortar, then mix in a shallow dish with the garlic, vinegar, sugar and coriander stalks. Roughly chop 3 of the charred jalapeños and add to the marinade with the remaining 2 tbsp oil. Add the cooked chops, turning to coat, then set aside for 10 minutes."
            },
            {
                "Step 3": "Remove the pork from the marinade, cut off the bone, then slice and toss back through the marinade (this is known as a reverse marinade – a quick way of adding more flavour). Slice the kernels from the cobs and mix with the coriander leaves, the juice from half a lime and some seasoning. Briefly toast the tortillas on the barbecue (or in a pan) until slightly charred but still flexible, then pile on the pork and corn. Crumble feta over and drizzle with the remaining marinade. Serve with the rest of the charred chillies and limes."
            }
        ],
        "image": "5.jpg"
    },
    {
        "id": "6",
        "title": "Taco slaw with pink pickled onions",
        "difficulty": "Easy",
        "portion": "Serves 4-6 as a side",
        "time": "Hands-on time 15 min, plus pickling",
        "description": "You need a zingy taco slaw to cut through the smoky richness of tacos – and this easy, colourful carrot slaw with quick-pickled onions has zest and crunch to spare.",
        "ingredients": [
            "1 red onion, finely sliced",
            "Juice of 5 limes",
            "1 garlic clove, finely chopped",
            "1 tsp cumin seeds",
            "½ tsp chipotle flakes (optional)",
            "½ tsp sugar",
            "1/4 white cabbage, finely shredded",
            "2 carrots, finely shredded",
            "1 jalapeño chilli, finely chopped",
            "Handful coriander, finely chopped",
            "1 tbsp rapeseed oil"
        ],
        "method": [
            {
                "Step 1": "Put the sliced red onion in a heatproof bowl, cover with boiling water for 20 seconds, then drain well and return to the bowl. Squeeze in the lime juice, then add the garlic, cumin seeds, chipotle flakes (if using), sugar and a big pinch of salt. Stir well, then set aside for at least 20 minutes to quick-pickle."
            },
            {
                "Step 2": "While the onion pickles,put the shredded cabbage and carrot in a colander. Add the finely chopped jalapeño and a good pinch of salt then scrunch together and set aside for 10 minutes to drain."
            },
            {
                "Step 3": "Squeeze the cabbage mixture to remove excess water, then put in a mixing bowl. Add the pickled onions, along with the pickling lime juice. Sprinkle in a handful of finely chopped coriander, drizzle in the rapeseed oil, give everything a mix, then taste and add extra salt if needed."
            }
        ],
        "image": "6.jpg"
    },
    {
        "id": "7",
        "title": "Smoky chipotle tofu with tomatoes and avocado",
        "difficulty": "Easy",
        "portion": "Serves 2-3",
        "time": "Hands-on time 15 min. Simmering time 7-8 min",
        "description": "Pair warm, intensely smoky, chipotle tofu with soothing smashed avocado. This vegan combo is incredible on toast or in breakfast tacos.",
        "ingredients": [
            "2 tbsp olive oil",
            "225g block smoked firm tofu, cut into small cubes",
            "3 tbsp chipotles in adobo",
            "½ tsp sea salt",
            "3 spring onions, finely sliced",
            "150g cherry tomatoes, halved",
            "Tacos or toast to serve",
            "1 large avocado",
            "Grated zest and juice 1 lime",
            "Garlic cloves",
            "Chilli oil or Korean chilli flakes",
            "Chopped coriander, chervil, tarragon, basil or dill",
            "Drizzle of tahini"
        ],
        "method": [
            {
                "Step 1": "For the smashed avocado, cut the avocado in half and discard the stone. Mash the garlic, if using, with ½ tsp salt using a knife or pestle and mortar. Mash with the avocado, then add the lime zest and juice (and, if using, the chilli oil/flakes, herbs and tahini). Season to taste."
            },
            {
                "Step 2": "Heat a frying pan over a medium-high heat and, when hot, add the olive oil, then the tofu. Fry for a few minutes until crisp, then add the chipotles. Stir-fry for a few minutes, seasoning with the sea salt, then add the spring onions and tomatoes. Turn the heat to medium and cook for 7-8 minutes until the tomatoes begin to break down. Taste and adjust the seasoning, then serve with the smashed avocado, in tacos or on toast."
            }
        ],
        "image": "7.jpg"
    },
    {
        "id": "8",
        "title": "Chilaquiles with fresh tomatillo salsa",
        "difficulty": "Medium",
        "portion": "Serves 4",
        "time": "Hands-on time 25 min, simmering time 10 min ",
        "description": "Thomasina Miers’ vegetarian chilaquiles is her take on one of Mexico’s most treasured recipes. Serve for breakfast with a fried egg, ricotta or refried beans and plenty of salsa.",
        "ingredients": [
            "200g leftover tortillas or good quality plain tortilla chips",
            "2 tbsp olive oil, plus extra for frying the tortillas (optional)",
            "300g fresh tomatillos or 350g tinned (see Know How for stockists or use green tomatoes instead)",
            "1 onion, cut into 8 wedges",
            "3 garlic cloves, unpeeled",
            "1 jalapeño chilli, de-stemmed",
            "25g coriander, leaves and stalks",
            "1 tbsp caster sugar",
            "1½ tsp salt",
            "500ml vegetable stock or water",
            "Juice ½ lime",
            "4 fried eggs",
            "Sliced avocado",
            "Soured cream",
            "A few handfuls coriander leaves",
            "Feta or lancashire cheese",
            "Finely chopped red onion or quick-pickled onions"
        ],
        "method": [
            {
                "Step 1": "If using up tortillas, cut them into triangles, pour a few tbsp of oil into a pan over a medium-high heat and shallow-fry until you have crisp tortilla chips. Set aside."
            },
            {
                "Step 2": "If you have fresh tomatillos, remove their husks and wipe with a damp cloth. Put a large frying pan over a medium-high heat and toast the onion, garlic, jalapeño and tomatillos. Shake and turn frequently until charred over and tender in the middle (6-7 minutes for the garlic and chilli and a little longer for the onion and tomatillos). When cool enough to handle, peel the garlic, then transfer to a blender/food processor along with the other charred ingredients, the coriander, sugar and salt. If you’re using tinned tomatillos, add them at this point. Whizz to a purée."
            },
            {
                "Step 3": "Warm the 2 tbsp oil in a pan over a medium heat and pour in the sauce. Fry, stirring, for 2-3 minutes until it darkens slightly. Pour in the veg stock or water and bring to a simmer. Add the lime juice and tortilla chips, then toss gently in the sauce for just long enough for some of them to soften. Taste and season if needs be, then remove from the heat and transfer to shallow bowls. Top with any serving suggestions or sides that you fancy."
            }
        ],
        "image": "8.jpg"
    },
    {
        "id": "9",
        "title": "Chipotle baked eggs",
        "difficulty": "Easy",
        "portion": "Serves 4",
        "time": "Hands-on time 25 min, plus simmering time 10 min ",
        "description": "Tommi Miers’ chipotle baked eggs are a simple way to start the day, with all the sweetly smoky flavours of a tomato-chipotle sauce. Mop up with tortillas or flatbreads.",
        "ingredients": [
            "3 tbsp olive oil",
            "1 onion, finely sliced",
            "2 garlic cloves, finely sliced",
            "1 small red pepper, deseeded and finely sliced",
            "1 red chilli, finely chopped",
            "1 tsp ground cumin",
            "1 tsp ground cinnamon",
            "1 tsp allspice",
            "A few large pinches of Mexican oregano or hoja santa (optional; see Know How)",
            "1 tbsp chipotles in adobo (or more to taste; see Know How)",
            "2 x 400g tins chopped tomatoes or 700g fresh tomatoes, chopped",
            "2-3 tsp brown sugar",
            "1 tbsp red wine vinegar",
            "8 medium free-range egg",
            "8 corn or flour tortillas",
            "Sliced avocado",
            "Handful coriander leaves or chervil, torn"
        ],
        "method": [
            {
                "Step 1": "Heat the oven to 170°C fan/gas 5. Warm the olive oil in a large ovenproof frying pan over a medium heat – or use a regular pan and transfer to a baking dish for step 3. Add the onion, garlic, pepper and chilli. Season with a few pinches of salt and fry gently for 20 minutes until the pepper is soft and sweet."
            },
            {
                "Step 2": "Add the spices and oregano/hoja santa, if using, Cook for 30 seconds more, then add the chipotles, tomatoes, sugar and vinegar with another big pinch of salt. The amount of sugar needed to season this will depend on whether you’re using tinned or fresh tomatoes and their ripeness. Pour in 250ml water, then simmer for 15 minutes until the sauce has reduced a little but is still loose enough to envelop the eggs. Taste to check the seasoning."
            },
            {
                "Step 3": "Make 8 small indents in the sauce and crack in the eggs. Bake in the oven for 12-15 minutes until the whites are just set. While the eggs are cooking, warm the tortillas, then serve with the avocado and a sprinkle of fresh herbs."
            }
        ],
        "image": "9.jpg"
    },
    {
        "id": "10",
        "title": "Venison tacos with grilled spring onions and peanut salsa",
        "difficulty": "Easy",
        "portion": "Serves 4",
        "time": "Hands-on time 30 min, plus resting. Oven time 8-10 min.",
        "description": "Dish up gourmet tacos at home with our recipe for venison tacos with grilled spring onions. Spoon the moreish Mexican peanut salsa on top and scatter with crumbled feta to serve.",
        "ingredients": [
            "2 venison steaks (about 250g each; or use British beef steaks)",
            "1 tbsp ground nut or veg oil",
            "2 bunches spring onions",
            "Tortillas, 100g crumbled feta, chopped coriander and lime wedges to serve",
            "250ml groundnut/veg oil",
            "6-8 dried Mexican chillies (we used ancho, guajillo and chipotle; see Know How), seeds and stems removed, torn",
            "4 large garlic cloves, sliced",
            "50g raw blanched peanuts",
            "1 tbsp sesame seeds",
            "2 tsp apple cider vinegar or white wine vinegar",
            "1 tsp dark brown sugar"
        ],
        "method": [
            {
                "Step 1": "Rub the venison with half the oil, season on both sides with salt, then set aside."
            },
            {
                "Step 2": "For the salsa, heat the oil in a small pan over a low-medium heat. Add the chillies and fry for 6-8 minutes until a little puffed, toasted and smelling fragrant. Put the chillies in a bowl, leaving the oil behind. Add the garlic to the oil and cook, stirring often, until crisp and light golden, then remove with a slotted spoon and add to the chillies. Add the peanuts and sesame seeds to the oil and fry for 5 minutes until lightly toasted, then stir in the vinegar and sugar and return the chillies and garlic to the pan. Set the pan aside to cool for 15 minutes, then whizz the contents in a food processor until everything is finely chopped. Taste and season with salt."
            },
            {
                "Step 3": "Heat the oven to 160ºC fan/gas 4. Heat an ovenproof frying pan over a high heat, cook the venison for 2-3 minutes on each side until browned, then transfer to the oven and cook for 8-10 minutes for medium-rare. Put on a plate to rest in a warm place (take care with the hot handle)."
            },
            {
                "Step 4": "Wipe out the pan and return to a high heat. Toss the spring onions with the remaining oil, then cook for 3-4 minutes, turning occasionally, until charred and tender. Set aside to cool slightly, then chop or leave whole."
            },
            {
                "Step 5": "Warm the tortillas according to the packet instructions. Thinly slice the venison and toss with any resting juices. Serve with the warm tortillas and the spring onions for everyone to assemble into tacos topped with crumbled feta, peanut salsa, chopped coriander and a squeeze of lime."
            }
        ],
        "image": "10.jpg"
    },
    {
        "id": "11",
        "title": "Easy huevos rancheros",
        "difficulty": "Medium",
        "portion": "Serves 2",
        "time": "Takes 20 minutes to make",
        "description": "When it comes to breakfast, huevos rancheros (ranch eggs) is the full Mexican. This weekend-treat deserves to become your Saturday go-to – plus it comes in at just £2.50 a portion.",
        "ingredients": [
            "400g tin black or pinto beans, rinsed and drained (or 160g dried beans, soaked and boiled – see tips)",
            "1 tbsp sunflower oil for frying",
            "4 small corn tortillas (see tips)",
            "2 medium free-range eggs",
            "1 avocado, sliced",
            "50g feta, crumbled (or queso fresco if you can find it)",
            "Hot sauce to serve (optional)",
            "2 tbsp sunflower oil",
            "1 small onion, finely chopped",
            "1 jalapeño chilli, seeds removed, sliced into matchsticks (plus extra, sliced, to serve – optional)",
            "1⁄2 tsp ground cumin",
            "1⁄2 tsp dried oregano",
            "3 medium tomatoes, finely chopped (or use 6 tbsp chopped tinned tomatoes)",
            "Small bunch coriander, chopped",
            "Juice 1⁄2 lime, plus wedges"
        ],
        "method": [
            {
                "Step 1": "For the salsa, heat the oil in a pan over a medium heat, then fry the onion and jalapeño until softened (about 4 minutes). Add the cumin, oregano and tomatoes, then cook for 3 minutes or until the mixture becomes saucy. Stir in half the coriander and season with some salt. Cover, turn the heat to low and simmer for 5 minutes. Season with lime juice."
            },
            {
                "Step 2": "Meanwhile, put the beans and a splash of water in a pan and warm over a low-medium heat until hot. Mash until mostly smooth with a little texture."
            },
            {
                "Step 3": "Heat the oil, then briefly fry the tortillas on both sides until just toasted. Drain on kitchen paper. Fry the eggs in the same oil until cooked to your liking."
            },
            {
                "Step 4": "Top the tortillas with the beans, salsa and eggs, then finish with avocado, feta and the remaining coriander. Serve with lime wedges and, if you like, extra jalapeño and/or hot sauce."
            }
        ],
        "image": "11.jpg"
    },
    {
        "id": "12",
        "title": "Turkey pozole",
        "difficulty": "Easy",
        "portion": "Serves 4-5",
        "time": "Hands-on time 25 min, plus simmering time 35 min ",
        "description": "This delicious version of pozole, a hearty Mexican soup, uses leftover turkey in place of the traditional pork, and is made with pozole corn.",
        "ingredients": [
            "1.5 litres chicken or turkey stock (or 2 chicken stock cubes dissolved in 1.5 litres water)",
            "1/2 small onion, peeled (use the other half for the salsa)",
            "3 garlic cloves, peeled",
            "400-500g shredded cooked turkey or chicken",
            "500g tin pozole corn (hominy), rinsed (or a 400g tin chickpeas, rinsed)",
            "1 tbsp dried oregano",
            "2 bay leaves",
            "1 tsp cumin",
            " 1/2 small onion (leave the skin on), cut into 2 wedges",
            "1 garlic clove (leave the skin on)",
            "2 ancho chillies, stalks and seeds removed (see Know How)",
            "2 dried guajillo chillies, stalks and seeds removed (see Know How)",
            "4 medium tomatoes, or a 400g tin plum tomatoes",
            "1 tsp brown sugar",
            "Half iceberg lettuce, shredded",
            "Small onion, finely sliced",
            "100g radishes, thinly sliced",
            "3 corn or flour tortillas, sliced into strips and shallow fried until crisp (or use tortilla chips)",
            "Handful coriander leaves, picked or finely chopped",
            "Lime wedges for squeezing",
            "Hot sauce and/or soured cream (optional)"
        ],
        "method": [
            {
                "Step 1": "Put the stock, onion and garlic cloves in a saucepan over a medium-high heat and bring to the boil. Reduce the heat, then simmer for 20 minutes."
            },
            {
                "Step 2": "Meanwhile, make the salsa. Char the onion wedges, tomatoes (if you’re using fresh) and garlic in a dry pan for 6-8 minutes until blackened. Peel and set aside."
            },
            {
                "Step 3": "Put the chillies in a small pan, then cover with boiling water and simmer for 5 minutes until the skins are softened. Drain, then add to a blender or food processor with the charred onion and garlic, tomatoes, sugar, 250ml cold water and a large pinch of salt. Add the softened onion and garlic from the stock, then whizz until smooth."
            },
            {
                "Step 4": "Pour the salsa back into the pan, then simmer for 10 minutes until reduced by about half. Add the salsa to the stock, then add the shredded meat, pozole corn or chickpeas, dried oregano, bay, cumin, and some more seasoning. Simmer gently for 5 minutes until warmed through and the meat takes on the flavour of the broth."
            },
            {
                "Step 5": "Ladle the soup into bowls and garnish with lettuce, onion, radishes, fried tortilla strips, coriander and lime wedges. Serve with hot sauce and/or soured cream, if you like."
            }
        ],
        "image": "12.jpg"
    },
    {
        "id": "13",
        "title": "Mexican-style barbecued beef brisket with quick-pickled onions",
        "difficulty": "Medium",
        "portion": "Serves 6-8",
        "time": "Hands-on time 45 min, oven time 5½ hours, grill/barbecue time 10 min, plus marinating",
        "description": "Beef brisket can be a tough joint, but this recipe guarantees fall-apart-tender meat with a Mexican flavour that will make your taste buds sit up and take notice.",
        "ingredients": [
            "2 tbsp vegetable oil",
            "1 red onion, chopped",
            "4 garlic cloves, crushed",
            "1 tbsp ground cumin",
            "1 tbsp ground coriander",
            "1-2 green or yellow jalapeños, sliced",
            "2 tbsp chipotle paste",
            "6 tbsp dark muscovado sugar",
            "2.25kg British beef brisket",
            "3 dried cascabel chillies (available from Waitrose, Ocado or online from Souschef)",
            "500ml good quality beef stock",
            "250ml fruity red wine",
            "200ml fresh orange juice",
            "200ml passata",
            "2 red onions, thinly sliced",
            "Juice 3 limes",
            "1 tbsp sea salt",
            "Large handful fresh coriander, roughly chopped",
            "Sliced green or yellow jalapeños",
            "2 ripe avocados, chopped",
            "Juice ½ lime, plus extra wedges",
            "Steamed rice or warm tortillas"
        ],
        "method": [
            {
                "Step 1": "Heat the oil in a large, deep frying pan. Add the chopped onion and fry for 5 minutes or until beginning to colour. Stir in the garlic, cumin, coriander, jalapeños, chipotle paste and sugar, season generously with salt and pepper, then cook for 1 minute more. Remove from the heat and allow to cool. If you like a smooth consistency, whizz in a mini food processor or pound in a pestle and mortar (optional)."
            },
            {
                "Step 2": "Rub the cooled onion and spice marinade all over the brisket, then transfer to a large food bag with any leftover marinade. Marinate for at least 2 hours or ideally overnight in the fridge (see Make Ahead). "
            },
            {
                "Step 3": "Meanwhile, for the pickled onions, toss the sliced onions with the lime juice and salt in a glass bowl, then leave for at least 2 hours until they’ve turned pink. "
            },
            {
                "Step 4": "Put the dried chillies, stock, wine, orange juice and passata in a large jug and stir until well combined."
            },
            {
                "Step 5": "Once ready to slow-cook, heat the oven to 140°C/120°C fan/gas 1. Put the brisket and any marinade from the bag in a large, deep roasting tin and pour over the stock mixture (including the chillies). Cover the meat with a layer of baking paper, then tightly cover the tin with 2 layers of foil, scrunching the edges to form a tight seal. Slow cook for 5-5½ hours, turning the meat over in the roasting tin halfway through the cooking time."
            },
            {
                "Step 6": "Once the brisket is fully tender (see tips) remove from the oven and set aside on a chopping board, loosely covered, to rest. Carefully pour the cooking liquid from the roasting tin into a saucepan and bubble over a high heat for 25-30 minutes to reduce to a sauce consistency. Taste and adjust the seasoning (see Make Ahead)."
            },
            {
                "Step 7": "Heat the grill to medium-high and cook for 5 minutes on each side, basting every 2 minutes with more sauce to give a charred sticky crust."
            },
            {
                "Step 8": "To serve, mix the coriander, jalapeños, avocados and lime juice in a bowl and serve alongside the brisket with the quick-pickled onions and steamed rice or warm tortillas."
            }
        ],
        "image": "13.jpg"
    },
    {
        "id": "14",
        "title": "Frozen mango margarita",
        "difficulty": "Easy",
        "portion": "Serves 1",
        "time": "Hands-on time 5 min, plus infusing time",
        "description": "This easy frozen mango margarita has a chilli kick thanks to homemade, jalapeno-infused tequila. Use ordinary tequila with a dash of chilli powder, if you’d prefer. The perfect slushie for barbecues and summer parties.",
        "ingredients": [
            "160ml jalapeño infused tequila (see below), or regular tequila and a pinch of chilli powder",
            "150g frozen mango chunks",
            "50ml fresh orange juice, plus extra to coat",
            "30ml orange liqueur (Grand Marnier, Cointreau or Triple Sec)",
            "Juice 1 lime, plus a little extra to coat",
            "Handful crushed ice",
            "Fresh jalapeño, thinly sliced, to serve (optional)",
            "350ml good quality tequila",
            "1 fresh jalapeño chilli, sliced",
            "1 wide strip lime zest",
            "1 tsp chilli powder (we used smoked)",
            "1 tsp fine sea salt"
        ],
        "method": [
            {
                "Step 1": "Start by infusing the tequila, if you’re making it. Put the cut chilli in a clean 500ml capacity jar. Add the sliced jalapeño, put the lid on and set aside at room temperature to infuse for at least 12 hours or up to 1 week depending on how spicy you like it. Pour the infused tequila through a muslin lined sieve set over a clean jug. Discard the chilli and zest."
            },
            {
                "Step 2": "To make the margarita, put all the drink ingredients (except the fresh jalapeño) in a blender and whizz to a smooth slushy consistency."
            },
            {
                "Step 3": "To serve, coat the rim of a glass with a little lime juice (put the glass in the freezer for 30 minutes beforehand if you like it extra chilled). Stir together the chilli powder and salt on a flat plate. Dip the moistened rim of the glass into the salt mix and tap to remove any excess. Scoop the mango margarita mix into the prepared glass and serve topped with jalapeño slices, if you like."
            }
        ],
        "image": "14.jpg"
    },
    {
        "id": "15",
        "title": "Raspberry margarita",
        "difficulty": "Easy",
        "portion": "Serves 1",
        "time": "Hands on time 10 min, plus cooling time",
        "description": "Learn how to make a raspberry margarita with our easy cocktail recipe. Tequila and Grand Marnier are served over ice with homemade raspberry syrup and a touch of lime.",
        "ingredients": [
            "60ml good quality tequila",
            "45ml raspberry syrup (see below)",
            "30ml orange liqueur (Grand Marnier, Cointreau or Triple Sec)",
            "1 cup crushed ice, plus extra to serve (optional)",
            "3-4 fresh raspberries to serve",
            "150g raspberries (fresh or frozen)",
            "100g granulated sugar",
            "50ml water",
            "Juice 1 lime",
            "Dash raspberry syrup",
            "1 tbsp freeze-dried raspberry powder",
            "2 tbsp caster sugar"
        ],
        "method": [
            {
                "Step 1": "For the raspberry syrup, combine the raspberries, sugar and water in a small pan and cook over a medium heat, stirring regularly until the sugar dissolves and the raspberries start to break down. Bring to a boil, then strain into a small bowl. Stir in the lime juice and leave to cool, then chill in the fridge until needed."
            },
            {
                "Step 2": "To make the margarita, put the crushed ice in a cocktail shaker, then pour in the tequila, raspberry syrup and Grand Marnier. Secure the lid and shake vigorously for 1 minute."
            },
            {
                "Step 3": "To serve, coat the rim of a glass with a little raspberry syrup. Stir together the raspberry powder and sugar on a flat plate. Dip the moistened rim of the glass into the sugar mix and tap to remove excess coating. Fill a glass with fresh crushed ice, the whole raspberries and a little extra raspberry syrup. Strain the margarita into the prepared glass and serve."
            }
        ],
        "image": "15.jpg"
    },
    {
        "id": "16",
        "title": "Enchiladas verdes",
        "difficulty": "Easy",
        "portion": "Serves 4-6",
        "time": "Hands-on time 30 min",
        "description": "These classic Mexican enchiladas verdes are filled with tender chicken thighs and covered with cheese and rich tomatillo sauce for a filling family dinner.",
        "ingredients": [
            "6 skinless and boneless free-range chicken thighs",
            "400g tin pinto beans (or use black beans if you prefer)",
            "200g mature cheddar, grated",
            "6 large tortilla wraps",
            "Small bunch coriander, leaves picked, to serve",
            "1 small red onion, thinly sliced, soaked in cold water, to serve",
            "1 red chilli, thinly sliced, to serve",
            "1 green chilli, thinly sliced, to serve",
            "100g queso fresco cheese or feta, crumbled, to serve and cut in half if large",
            "790g tin tomatillos",
            "50g coriander, leaves and stalks roughly chopped",
            "½ white onion, roughly chopped",
            "1-2 fresh jalapeño chilli, halved, seeds removed",
            "2 large garlic cloves, peeled",
            "Grated zest and juice 2 limes"
        ],
        "method": [
            {
                "Step 1": "Heat the oven to 160ºC fan/gas 4. To make the salsa, put all the ingredients in a food processor or blender with a large pinch of salt and whizz until everything is finely chopped. Put the chicken thighs in the roasting dish and toss with 150ml of the salsa, cover tightly with foil, then cook in the oven for 30 minutes until cooked through. Shred the chicken and mix in a large bowl with the pinto beans, 150g of the cheddar and 2-3 tbsp of the salsa."
            },
            {
                "Step 2": "Increase the oven to fan 180ºC/gas 6. Pour half the remaining salsa into the baking dish. Dip a tortilla into the salsa, lightly coating both sides. Divide the chicken mix into 6 portions, then arrange one portion along the middle of a wrap. Roll up and put in the baking dish. Repeat with the remaining tortillas and filling. Drizzle over the remaining salsa, sprinkle with the remaining 50g cheddar, then bake in the oven for 20-30 minutes until bubbling and golden."
            },
            {
                "Step 3": "Serve piping hot, topped with the coriander, onion, chillies and queso fresco/feta, with extra lime and sour cream on the side if you like."
            }
        ],
        "image": "16.jpg"
    },
    {
        "id": "17",
        "title": "Margarita cheesecake with tequila strawberries",
        "difficulty": "Easy",
        "portion": "Serves 10",
        "time": "Hands-on time 20 min, plus 4-6 hours setting/marinating time",
        "description": "For a make-ahead cheesecake with a twist, try our incredible margarita cheesecake, with crushed pretzel base and boozy tequila strawberries on top.",
        "ingredients": [
            "140g pretzel thins (we like Olly’s Pretzels Salted Original)",
            "2 tsp caster sugar",
            "90g unsalted butter, melted",
            "360g cream cheese",
            "150g soured cream",
            "100g icing sugar, sifted",
            "Finely grated zest 1 lime",
            "Finely grated zest ½ orange",
            "150ml double cream",
            "4 gelatine leaves, soaked in cold water for 10 minutes (we used Dr Oetker)",
            "100g caster sugar",
            "Juice 6 limes, strained",
            "Juice 1 orange, strained",
            "2 tbsp tequila",
            "1 tbsp Grand Marnier, Cointreau or Triple Sec",
            "100ml lime soda (we used Fever Tree Mexican lime soda)",
            "300g strawberries, hulled and sliced",
            "100g pure icing sugar, sifted",
            "1-2 tbsp tequila",
            "1 tbsp Grand Marnier, Cointreau or Triple Sec",
            "Grated zest 1 lime",
            "Grated zest ½ orange",
            "Flaky salt to serve (optional)"
        ],
        "method": [
            {
                "Step 1": "Put the pretzel thins and caster sugar in a food processor and whizz to fine crumbs. Pour in the melted butter and whizz again until the mixture comes together (it should hold its shape when scrunched together). Spoon into a 20cm loose-bottomed cake tin, then smooth the surface with the back of a spoon to level, pressing to compact a little. If you don’t have a food processor put the pretzels into a food bag and bash with a rolling pin, then mix in a bowl with the sugar and melted butter. Set aside in the fridge while you make the filling."
            },
            {
                "Step 2": "In a large mixing bowl beat together the cream cheese, soured cream, icing sugar, and zests until smooth. In another bowl, whip the cream to soft peaks, then gently fold it into the cream cheese mixture until combined. Pour the cheesecake filling on top of the biscuit base and level the top with a spatula. Set aside in the fridge for 2 hours until set firm."
            },
            {
                "Step 3": "To make the margarita layer, put the sugar, lime and orange juice in a small heavy based saucepan over low heat, stirring until the sugar dissolves. Squeeze the soaked gelatine leaves to remove excess water, then stir them into the warm juice mixture until fully melted. Add the tequilla, Grand Marnier and lime soda and stir to combine, then set aside to cool. Pour the jelly over the set cheesecake mixture. Cover, and return to the fridge until fully set for at least 2 hours or overnight."
            },
            {
                "Step 4": "For the tequila strawberries, combine all the ingredients in a bowl. Stir to combine, then cover and set aside in the fridge until ready to serve. As the strawberries sit, they will create their own syrup. Cut the cheesecake in to slices and serve with the strawberries and a drizzle of tequila strawberry syrup."
            }
        ],
        "image": "17.jpg"
    },
    {
        "id": "18",
        "title": "Bolognese quesadilla",
        "difficulty": "Easy",
        "portion": "Serves 4",
        "time": "Hands-on time 15 min",
        "description": "Make this tasty quesadilla recipe with leftovers from the night before: bolognese sauce is transformed into a meaty Mexican-spiced filling.",
        "ingredients": [
            "400g tin red kidney beans, drained and rinsed (see tips)",
            "1 tbsp sliced pickled jalapeño chillies from a jar, roughly chopped",
            "250g beef bolognese sauce (we used leftover easy midweek spaghetti bolognese; see tips)",
            "Handful coriander leaves, roughly chopped",
            "200g monterey jack cheese, grated (see Know-how)",
            "2 large wheat tortillas",
            "Soured cream to serve",
            "1 large avocado, diced",
            "Small handful fresh coriander leaves, roughly chopped",
            "1 spring onion, finely sliced",
            "½ fresh jalapeño chilli, deseeded and finely chopped",
            "Juice ½ lime, plus wedges to serve",
            "1 tbsp olive oil"
        ],
        "method": [
            {
                "Step 1": "In a medium bowl, mix the drained red kidney beans, pickled jalapeños, bolognese sauce and chopped fresh coriander leaves. Divide the mixture, along with the grated cheese, between the tortillas. Fold each tortilla in half to encase the filling."
            },
            {
                "Step 2": "Heat a large dry frying pan over a low-medium heat and toast the quesadillas one at a time for 2-3 minutes on each side until the filling is hot, the cheese is melted and the tortilla is crisp and golden on the outside. Keep warm."
            },
            {
                "Step 3": "While the quesadillas cook, mix all the salsa ingredients together in a small bowl and season to taste with a little salt."
            },
            {
                "Step 4": "Cut the quesadillas into wedges and serve with the salsa, soured cream and lime wedges on the side to squeeze over."
            }
        ],
        "image": "18.jpg"
    },
    {
        "id": "19",
        "title": "Sausage burritos with pea and avocado guacamole",
        "difficulty": "Easy",
        "portion": "Makes 4 large or 6 smaller burritos",
        "time": "Hands-on time 30 min",
        "description": "Shake up your routine and fill your next burritos with pork sausages and a twist on guacamole made with peas and avocados.",
        "ingredients": [
            "2 tsp olive oil",
            "454g pack sausages, skins removed",
            "3 tbsp Mexican spice mix (or use fajita seasoning)",
            "1 red onion, sliced",
            "2 mixed peppers, sliced – we used red and orange",
            "198g tin sweetcorn, drained",
            "2 avocados, roughly chopped",
            "100g frozen peas, cooked",
            "Juice 1 lime",
            "4 large or 6 small tortilla wraps",
            "2 x 250g pouches cooked basmati rice",
            "125g mature cheddar, grated",
            "Handful fresh coriander",
            "Microwave",
            "Compostable baking paper"
        ],
        "method": [
            {
                "Step 1": "Heat 1 tsp of the oil in a large frying pan. Add the sausages and cook for 9-10 minutes until cooked through, breaking into small chunks with a wooden spoon. Add the spice mix and fry for 1 minute more, then remove with a slotted spoon."
            },
            {
                "Step 2": "Heat the remaining 1 tsp oil in the same pan and fry the onion and peppers for 5 minutes. Stir in the corn and fry for another 2 minutes."
            },
            {
                "Step 3": "Put the avocados, peas, lime juice and some salt and pepper in a mini blender and whizz until smooth – or mash with a fork for a chunkier texture."
            },
            {
                "Step 4": "Warm the tortillas and rice in the microwave according to the pack instructions, then set each tortilla on a square of baking paper. Divide the grated cheese, veg mixture, sausage and most of the coriander and hot rice among the tortillas. Add a dollop of guacamole, then roll up each tortilla and secure with the baking paper."
            },
            {
                "Step 5": "Heat a dry frying pan and add the burritos in their wrappers. Gently press down the burritos and cook for 2-3 minutes on each side until you can see through the paper that the tortilla is golden. Slice in half and serve with the remaining guacamole and coriander."
            }
        ],
        "image": "19.jpg"
    },
    {
        "id": "20",
        "title": "Taco traybake",
        "difficulty": "Easy",
        "portion": "Serves 6",
        "time": "Hands-on time 15 min, oven time 1 hour 40 min",
        "description": "This taco traybake topped with melted cheese really cuts down on the washing up when you’re cooking a midweek meal. Serve with guacamole.",
        "ingredients": [
            "Vegetable oil for frying",
            "1kg beef stewing steak or pork shoulder, cut into 2cm chunks",
            "2 red onions, sliced",
            "2 mixed sweet peppers, sliced",
            "2-3 tbsp mexican spice mix or fajita seasoning",
            "400g tinned tomatoes",
            "300ml chicken stock or water",
            "Juice 2 oranges",
            "198g tin sweetcorn, drained",
            "3 tortilla wraps, cut into triangles",
            "50g cheddar, grated",
            "Fresh coriander and lime wedges to serve (optional)",
            "Shallow flameproof casserole or heavy-based ovenproof saucepan with a lid"
        ],
        "method": [
            {
                "Step 1": "Heat the oven to 200°C/180°C fan/gas 6. Heat the oil in the casserole/saucepan over a high heat, then add the meat, onions and peppers. Fry for 5 minutes, then stir in the spice mix or fajita seasoning and cook for another minute."
            },
            {
                "Step 2": "Stir in the tomatoes and stock/water and bring to the boil, then cover the casserole/saucepan and transfer to the oven. Cook for 1½ hours, stirring halfway through, until the meat falls apart easily when pressed with a spoon. Remove from the oven and stir, breaking up the meat as you do (see Make Ahead)."
            },
            {
                "Step 3": "Stir in the orange juice and sweetcorn, then top with the tortilla triangles, scatter with the cheese and return to the oven for 10 minutes until the tortilla pieces are golden and the cheese has melted."
            },
            {
                "Step 4": "Serve topped with coriander and lime wedges on the side if you like."
            }
        ],
        "image": "20.jpg"
    },
    {
        "id": "21",
        "title": "Slow-cooked chipotle chicken",
        "difficulty": "Easy",
        "portion": "Serves 6-8",
        "time": "Hands-on time 25 min, oven time 2 hours",
        "description": "Our slow-cooked chipotle chicken takes inspiration from great Mexican flavours to create an uncomplicated one-pot dinner. The star is the flavour of chipotle, which is a smoke-dried jalapeño chilli and a Mexican staple. Obviously we’ve thrown in guacamole for a side, because – well, who doesn’t like guacamole?",
        "ingredients": [
            "4 tbsp extra-virgin olive oil8 skinless, boneless free-range chicken thighs (about 1.4kg), halved2 red onions, cut into wedges2 red peppers, sliced4 garlic cloves, crushed2 tsp ground cumin2 tsp sweet smoked paprika2 tbsp chipotle paste (see Know-how)1 tbsp good-quality cocoa powder2 x 400g tins chopped tomatoes300ml chicken stock400g tin black beans or kidney beans, rinsed and drainedWarm tortillas, soured cream, coriander leaves and limewedges to serve",
            "4 tbsp extra-virgin olive oil",
            "8 skinless, boneless free-range chicken thighs (about 1.4kg), halved",
            "2 red onions, cut into wedges",
            "2 red peppers, sliced",
            "4 garlic cloves, crushed",
            "2 tsp ground cumin",
            "2 tsp sweet smoked paprika",
            "2 tbsp chipotle paste (see Know-how)",
            "1 tbsp good-quality cocoa powder",
            "2 x 400g tins chopped tomatoes",
            "300ml chicken stock",
            "400g tin black beans or kidney beans, rinsed and drained",
            "Warm tortillas, soured cream, coriander leaves and limewedges to serve",
            "3 avocados, peeled and choppedJuice 1-2 limes1 green chilli, seeds removed, chopped2 spring onions, choppedSmall handful chopped coriander",
            "3 avocados, peeled and chopped",
            "Juice 1-2 limes",
            "1 green chilli, seeds removed, chopped",
            "2 spring onions, chopped",
            "Small handful chopped coriander"
        ],
        "method": [
            {
                "Step 1": "Heat the oven to 170°C/150°C fan/gas 3½. Heat 2 tbsp of the oil in a hob safe casserole or large ovenproof sauté pan (you’ll need a lid) over a high heat, then fry the chicken in batches, turning often, for 3-4 minutes until browned all over. Remove and set aside."
            },
            {
                "Step 2": "Heat the remaining oil in the casserole/pan, then fry the onions and peppers for 2-3 minutes. Add the garlic, cumin, paprika, chipotle paste and cocoa, stirring to combine."
            },
            {
                "Step 3": "Return the chicken and any juices to the casserole, stir to coat, then add the chopped tomatoes and stock. Bring to a simmer, season with salt and pepper, then cover and cook in the oven for 1½ hours."
            },
            {
                "Step 4": "Add the beans to the stew and cook, uncovered, for 30 minutes more until the sauce has reduced and thickened."
            },
            {
                "Step 5": "Meanwhile, put all the guacamole ingredients in a food processor. Season with salt and pepper, add a little more lime juice to taste, then pulse until roughly chopped and combined but still with some texture. (Or mash everything together in a mixing bowl with a fork until as smooth as possible.)"
            },
            {
                "Step 6": "Serve the chicken on warm tortillas topped with guacamole, soured cream, coriander and a squeeze of lime."
            }
        ],
        "image": "21.jpg"
    },
    {
        "id": "22",
        "title": "Beef burrito bowls",
        "difficulty": "Easy",
        "portion": "SERVES 4",
        "time": "HANDS-ON TIME 30 MIN",
        "description": "These easy beef burrito bowls are fun to make and have a spicy chipotle kick! The whole family will love building their own.",
        "ingredients": [
            "1 tbsp sunflower oil, plus extra to brush",
            "2 red onions, sliced",
            "500g British beef mince (5% fat)",
            "2 tsp chipotle chilli paste (from larger supermarkets)",
            "200ml boiling water",
            "4 medium tortilla wraps",
            "2 little gem lettuces or ¼ iceberg lettuce, shredded",
            "250g cherry tomatoes, halved",
            "½ cucumber, diced",
            "6 tbsp greek yogurt",
            "1 lime, quartered, to serve",
            "Pinch paprika, optional"
        ],
        "method": [
            {
                "Step 1": "Heat the oven to 200°C/180°C fan/ gas 6. Heat the 1 tbsp oil in a large non–stick frying pan, add the red onions and beef mince, then fry over a medium heat for 6-8 minutes until the onions have started to soften and the beef has browned."
            },
            {
                "Step 2": "Mix the chipotle paste with the boiling water, then add to the pan.Season with salt and black pepper, then simmer for 6-8 minutes until the liquid has cooked off."
            },
            {
                "Step 3": "Meanwhile, brush the tortillas with a little oil, then put each onein an ovenproof bowl (pudding basins are ideal). Bake for 5-6 minutes until golden and firm – work in batches if you only have 1 or 2 bowls. Remove from the oven and leave to cool while you repeat with the remaining tortillas."
            },
            {
                "Step 4": "To serve, half-fill the tortilla cases with shredded lettuce, then top with the hot chipotle beef, tomatoes and cucumber. Add a dollop of yogurt and a lime wedge to each, then sprinkle with paprika (if using) and serve straightaway."
            }
        ],
        "image": "22.jpg"
    },
    {
        "id": "23",
        "title": "Classic margarita cocktail",
        "difficulty": "Easy",
        "portion": "Makes 1",
        "time": "Takes 5 minutes to make",
        "description": "Learn how to make a perfect classic margarita cocktail with our easy recipe. Plus discover how to scale up this classic Mexican tequila drink to serve a crowd.",
        "ingredients": [
            "60ml good quality tequila",
            "45ml fresh lime juice",
            "30ml orange liqueur (Grand Marnier, Cointreau or Triple Sec)",
            "1 cup crushed ice, plus extra to serve (optional)",
            "1 lime wedge to serve",
            "Fine sea salt to serve"
        ],
        "method": [
            {
                "Step 1": "Put the crushed ice in a cocktail shaker, then pour over the tequila, lime juice and Grand Marnier. Secure the lid and shake vigorously for 1 minute."
            },
            {
                "Step 2": "Sweep the lime wedge around the rim of a cocktail or lowball glass to moisten the edge with a little lime juice. Dip the rim of the glass into fine salt and shake off excess. Strain the margarita into the prepared glass, filled with fresh crushed ice if you like. Serve garnished with the lime wedge."
            }
        ],
        "image": "23.jpg"
    },
    {
        "id": "24",
        "title": "Ensenada fish tacos",
        "difficulty": "Easy",
        "portion": "Serves 4-5 (makes 15 tacos)",
        "time": "Hands-on time 1 hour, plus pickling",
        "description": "Karla Zazueta’s take on Ensenada fish tacos – a Mexican delicacy bursting with fresh, zingy flavours and wonderfully crunchy textures – makes a vibrant family dinner and will satisfy everyone at the table.",
        "ingredients": [
            "140g plain flour, plus extra for dusting",
            "1½ tsp baking powder",
            "1 large free-range egg",
            "1 tsp fine garlic salt",
            "Pinch dried oregano",
            "1 tsp american or dijon mustard",
            "300g sustainable cod fillet, cut into 2cm strips",
            "1 litre vegetable oil for deep frying",
            "15 small corn tortillas to serve (see tip)",
            "Iceberg lettuce, finely shredded, to serve",
            "Lime wedges for squeezing",
            "1 tbsp fine sea salt",
            "1 medium red onion, cut into thin strips",
            "Juice 1 lime",
            "Pinch of dried oregano",
            "1 scotch bonnet chilli, finely chopped",
            "3 medium ripe tomatoes, finely chopped",
            "1 small onion, finely chopped",
            "3 tbsp chopped fresh coriander ",
            "Juice 1 lime",
            "3 tbsp soured cream",
            "3 tbsp good quality mayonnaise",
            "Digital probe thermometer; 2 baking trays lined with kitchen paper"
        ],
        "method": [
            {
                "Step 1": "For the pickled onion, mix the salt with the onion in a small non-metallic bowl, then set aside for 10 minutes. Rinse the onion, drain, then toss with the lime juice, oregano, chilli and a pinch of salt."
            },
            {
                "Step 2": "For the pico de gallo, mix the tomatoes, onion, coriander, lime juice and a pinch of salt in a non-metallic bowl."
            },
            {
                "Step 3": "For the mayo sauce, mix the soured cream and mayo in a bowl with some black pepper."
            },
            {
                "Step 4": "To make the batter, mix the flour, baking powder, egg, garlic salt, oregano, mustard and a grinding of black pepper in a large mixing bowl. Whisk in 175ml water, little by little, stopping when the batter reaches the consistency of double cream (add a few extra splashes of water if you need to)."
            },
            {
                "Step 5": "Dry the fish on kitchen paper, then lightly dust with flour (to help the batter stick). Once all the pieces are dusted, drop each one into the batter and coat well."
            },
            {
                "Step 6": "Pour the oil into a deep heavy-based pan to a depth of about 10cm, then heat until it reaches 180°C on a thermometer (or a cube of bread browns in 20 seconds)."
            },
            {
                "Step 7": "Deep-fry the fish in batches for 3 minutes on each side until golden brown, then drain on the prepared baking trays. Repeat until all the fish is fried."
            },
            {
                "Step 8": "Warm the tortillas, spread with the mayo sauce, then add 1-2 pieces of fried fish, lettuce, salsa and some pickled onion. Serve with lime wedges and cold beer."
            }
        ],
        "image": "24.jpg"
    },
    {
        "id": "25",
        "title": "Tex-Mex enchilada bake",
        "difficulty": "Easy",
        "portion": "Serves 4 (plus sauce to feed another 4)",
        "time": "Hands-on time 25 min, cooking time 45 min",
        "description": "Here’s a comforting enchiladas recipe to simplify weeknight dinner planning; this bubbling bake is bursting with flavour and will leave you feeling properly fed and satisfied – just what you want from a midweek meal.",
        "ingredients": [
            "Splash light olive oil 450g British free-range pork mince",
            "450g British beef mince (5% fat)",
            "2 onions, sliced ",
            "1½ tbsp cumin seeds, roughly crushed",
            "1-3 tbsp chipotle paste (to taste; we used the Gran Luchito brand, from large supermarkets)",
            "2 x 400g cans chopped tomatoes",
            "3 medium red peppers, sliced ",
            "150g soured cream",
            "4 large tortilla wraps ",
            "1-2 handfuls grated mature cheddar cheese"
        ],
        "method": [
            {
                "Step 1": "Heat the oil in a deep, heavy-based frying pan (with a lid) over a medium-high heat. Brown the mince, in 2 batches, stirring regularly until golden and crisp (around 7 minutes per batch). Remove the mince with a slotted spoon and set aside."
            },
            {
                "Step 2": "Turn the heat to medium and add the onions to the pan, stirring with a wooden spoon to dissolve any brown bits from the base. Cover and cook for 5 minutes, stirring now and again."
            },
            {
                "Step 3": "Add the cumin, cook for a minute, then add the chipotle paste, tomatoes and 175ml water. Stir well, bring to the boil, then simmer, uncovered, for 15 minutes. Return the mince to the pan, put the peppers on top, then cover with the lid. Cook for 10 minutes more until the peppers are tender, then season and stir the peppers into the sauce."
            },
            {
                "Step 4": "When ready to serve, heat the oven to 180°C/160°C fan/gas 4. Divide half the mince sauce equally among the 4 tortillas, roll up, then arrange in a baking dish (use one that just fits the wraps). Mix the soured cream with 1 tbsp cold water, then spoon over the top and scatter with the cheese (see tips). Bake for 20 minutes until golden and the cheese has melted."
            }
        ],
        "image": "25.jpg"
    },
    {
        "id": "26",
        "title": "Scampi tacos with jalapeño tartare sauce and avocado",
        "difficulty": "Easy",
        "portion": "Serves 3-4",
        "time": "Hands-on time 30 min, oven time 12-14 min",
        "description": "These scampi-topped tacos both look and sound impressive but they really couldn’t be easier to make. The jalapeño tartare sauce is the ultimate finishing touch – just combine all the ingredients and voilà!",
        "ingredients": [
            "400g jumbo wholetail breaded scampi (we used Whitby Seafoods)",
            "3 tortilla wraps",
            "½ round lettuce, torn",
            "1 avocado, finely sliced",
            "150g radishes, cut into wedges",
            "Lemon, cut into wedges for squeezing",
            "2 tbsp mayonnaise",
            "4 tbsp soured cream",
            "Splash white wine vinegar",
            "1 tbsp each chopped fresh tarragon and chopped fresh flatleaf parsley",
            "40g cornichons, chopped",
            "2 jalapeños, finely sliced"
        ],
        "method": [
            {
                "Step 1": "Heat the oven to 220°C/200°C fan/ gas 7. Spread out the scampi on a baking sheet and cook for 12-14 minutes or according to the packet instructions."
            },
            {
                "Step 2": "For the jalapeño tartare sauce, mix all the ingredients together, then season to taste (see Make Ahead). "
            },
            {
                "Step 3": "Put the tortilla wraps in the oven for the final 1-2 minutes of the scampi cooking time to warm them through. Remove the scampi and tortillas from the oven, then cut each wrap into 4 wedges."
            },
            {
                "Step 4": "Arrange the tortilla wedges on a board or platter, then top each with some torn lettuce, sliced avocado, 2-3 hot scampi, a drizzle of tartare sauce and some radish wedges. Squeeze over lemon juice to serve. "
            }
        ],
        "image": "26.jpg"
    },
    {
        "id": "27",
        "title": "Crispy tacos with charred veg and refried beans",
        "difficulty": "Easy",
        "portion": "Serves 4",
        "time": "Hands-on time 45 min",
        "description": "Crispy tortillas are topped with spicy refried beans, warm veg and gooey feta in this fantastic vegetarian dinner. Try swapping the feta for fried halloumi if you prefer a milder flavour.",
        "ingredients": [
            "Olive oil for frying",
            "2 corn on the cobs",
            "250g chestnut mushrooms, sliced",
            "200g runner beans (or helda beans), cut into 2cm piece",
            "400g tin black beans, drained and rinsed",
            "2-3 tbsp chipotle paste",
            "2 tbsp soured cream",
            "100g vegetarian feta, crumbled",
            "8 small soft tortillas",
            "Olive oil for brushing",
            "1 sweet white onion, finely chopped",
            "4 vine tomatoes, deseeded and finely chopped",
            "Large handful fresh coriander, roughly chopped",
            "Juice 1-2 limes"
        ],
        "method": [
            {
                "Step 1": "Heat a glug of oil in a frying pan and cook the corn cobs over a medium-high heat for 15 minutes or so, turning regularly, until lightly charred. Once cool, slice off the kernels into a bowl and set aside. "
            },
            {
                "Step 2": "Add more oil to the pan and cook the mushrooms until golden but still with a bit of bite. Remove with a slotted spoon and add to the corn."
            },
            {
                "Step 3": "Add the runner or helda beans to the pan and cook for about 5 minutes until charred, adding more oil if needed. Return the corn and mushrooms to the pan, then reduce the heat to keep warm."
            },
            {
                "Step 4": "For the tacos, heat a second frying pan and brush the tortillas with a little oil. Fry on each side until crisp. Transfer to a low oven to keep warm as you cook the rest of the tortillas."
            },
            {
                "Step 5": "Combine all the salsa ingredients in a serving bowl. "
            },
            {
                "Step 6": "Put the black beans in a small pan and mash lightly with the back of a fork. Stir in the chipotle paste and soured cream, bring to a simmer, then season with salt and pepper (see Make Ahead)."
            },
            {
                "Step 7": "To serve, crumble the feta into the veg and toss gently. Spread each crispy tortilla with black beans and the vegetable/feta mix, then top with the salsa."
            }
        ],
        "image": "27.jpg"
    },
    {
        "id": "28",
        "title": "Slow-cooked chicken tinga tacos with pickled onions",
        "difficulty": "Medium",
        "portion": "Serves 4",
        "time": "Hands-on time 30 min, oven time 2 hours",
        "description": "Chicken thighs are slow-cooked with ancho chillies and chipotle paste until pull-apart tender and infused with all their spicy flavour. Shred the meat and then use to top soft tortilla wraps along with the homemade pickled onions and lots of soured cream.",
        "ingredients": [
            "2 dried ancho chillies (from Sainsbury’s, Waitrose, Ocado and souschef.co.uk)",
            "2 dried cascabel chillies (from Waitrose, Ocado and souschef.co.uk)",
            "Olive oil for frying",
            "1kg skinless, boneless free-range chicken thighs, sliced",
            "1 large onion, finely chopped",
            "1 red pepper, finely chopped",
            "4 garlic cloves, crushed",
            "½ tsp dried thyme",
            "2 tbsp tomato purée",
            "4 tbsp chipotle paste",
            "500g ripe tomatoes, roughly chopped",
            "3 fresh thyme sprigs",
            "12 small soft tacos or 8 tortilla wraps",
            "Soured cream, fresh coriander and lime wedges to serve",
            "2 red onions, finely sliced",
            "Juice 3 limes",
            "2 tsp sea salt flakes",
            "Casserole with a lid"
        ],
        "method": [
            {
                "Step 1": " Heat the oven to 180°C/160°C fan/ gas 4. Put the dried chillies in a heatproof bowl/jug, pour over 350ml freshly boiled water, then set aside to rehydrate for 15 minutes."
            },
            {
                "Step 2": "Meanwhile, heat a splash of oil in the casserole and brown the chicken in batches. Transfer to a bowl, then set aside. Add another splash of oil to the casserole, turn the heat down and gently fry the onion and pepper for 10 minutes until softened. Stir in the garlic and dried thyme, then cook for 2 minutes more. "
            },
            {
                "Step 3": "Stir in the tomato purée and chipotle paste and cook for 1-2 minutes. Return the chicken with any resting juices to the casserole, stirring well to coat. "
            },
            {
                "Step 4": "Strain the chillies into the casserole to add the soaking water, leaving the chillies in the sieve. Once the chillies are cool enough to handle, remove the stalks/seeds (discard), then add the chillies to the pan."
            },
            {
                "Step 5": "Add the chopped tomatoes, fresh thyme and a generous pinch of sea salt flakes (see tip). Bring to a simmer, cover with the lid, then cook in the oven for 2 hours. Give everything a stir halfway through to stop the sauce sticking. "
            },
            {
                "Step 6": "Meanwhile, make the pink pickled onions: put the onions, lime juice and salt in a small glass or ceramic dish, then toss to coat. Set aside for 2 hours, stirring occasionally."
            },
            {
                "Step 7": "Once the chicken is cooked through and tender, remove and discard the chillies and thyme sprigs. Using 2 forks, shred the chicken in the pan. Turn off the oven and put the tortillas inside to warm for a few minutes."
            },
            {
                "Step 8": "Serve the chicken in the middle of the table with the warm tortillas, soured cream, pink pickled onions, fresh coriander and lime wedges on the side, letting everyone construct their own taco."
            }
        ],
        "image": "28.jpg"
    },
    {
        "id": "29",
        "title": "Mexican chicken and red rice burrito bowls",
        "difficulty": "Easy",
        "portion": "Serves 4",
        "time": "Hands-on time 15 min, simmering time 5 min",
        "description": "Use a few spare tortilla wraps and some leftover chicken to help make these filling and healthy Mexican chicken and rice burrito bowls.",
        "ingredients": [
            "Juice 2 limes, plus extra wedges to serve",
            "1 small red onion, finely sliced",
            "2 leftover corn tortilla wraps",
            "1 tbsp vegetable oil",
            "2-3 tbsp fajita spice mix, to taste",
            "200ml tomato passata",
            "250g cooked basmati rice (use a ready-cooked pouch if you want to)",
            "198g tin sweetcorn, drained",
            "400g tin black beans, drained and rinsed",
            "Large handful fresh coriander, roughly chopped",
            "450g leftover roast chicken or 3 cooked free-range chicken breasts, shredded"
        ],
        "method": [
            {
                "Step 1": "Put the lime juice in a small glass or ceramic bowl, then add the red onion and a generous pinch of salt. Toss, then set aside to quick-pickle."
            },
            {
                "Step 2": "Heat the grill to medium-high. Grill the wraps for a minute or so on each side until lightly golden. Cool, then roughly break up to make chunky croutons (see Make Ahead)."
            },
            {
                "Step 3": "Heat the vegetable oil in a frying pan, add the spice mix and fry for 1 minute until fragrant. Pour in the passata and bring to a simmer, cook for a few minutes, then add the rice. Cook for 5 minutes until piping hot."
            },
            {
                "Step 4": "Toss the sweetcorn, black beans and most of the coriander together in a mixing bowl."
            },
            {
                "Step 5": "Divide the rice, sweetcorn and bean mixture, quick-pickled red onion and shredded chicken among 4 serving bowls. Top with the tortilla croutons and remaining coriander, then serve with lime wedges to squeeze over."
            }
        ],
        "image": "29.jpg"
    },
    {
        "id": "30",
        "title": "Cornbread with Mexican-style salad",
        "difficulty": "Easy",
        "portion": "Serves 6 as a side",
        "time": "Hands-on time 10 min, oven time 20 min",
        "description": "This rich and cheesy cornbread is served with a bright corn and tomato salad to cut through it all. Serve as a snack or nibble to please the masses. It’s great enjoyed alongside one of our chilli recipes, too.",
        "ingredients": [
            "Melted butter",
            "120g fine cornmeal",
            "120g self-raising flour",
            "1½ tsp caster sugar",
            " ½ tsp salt",
            " 275g natural yogurt",
            "1 medium free-range egg",
            "90g melted butter, plus extra for greasing",
            "75g crumbled lancashire cheese",
            "2 corn cobs",
            "½ tsp olive oil",
            "Large handful of watercress",
            "250g halved cherry tomatoes",
            "25g crumbled lancashire"
        ],
        "method": [
            {
                "Step 1": "Heat the oven to 220°C/200°C fan/gas 7. Brush the inside of a 23cm ovenproof frying pan with a little melted butter. In a bowl, combine the cornmeal, self-raising flour, caster sugar and salt. Mix the natural yogurt, egg, melted butter and 50g crumbled lancashire cheese in a measuring jug. Pour the wet mixture into the dry and stir to combine. "
            },
            {
                "Step 2": "Run a sharp knife down the side of the corn cobs to remove the kernels (discard the cobs). Add three quarters of the kernels to the batter, then pour into the pan. Bake for 20 minutes. Meanwhile, toss the remaining corn ona baking tray with ½ tsp olive oil and roast for 10 minutes."
            },
            {
                "Step 3": "Toss together a large handful of watercress, the halved cherry tomatoes, 25g crumbled lancashire and the roast corn kernels. Scatter over the cornbread to serve. "
            }
        ],
        "image": "30.jpg"
    }
]